jch12138/nrf52840_rtt/applications/ble_app_hrs.c
/**@brief Struct that contains pointers to the encoded advertising data. */

static void advertising_init(void)
{
    ret_code_t             err_code;
    ble_advertising_init_t init;

    memset(&init, 0, sizeof(init));

    init.advdata.name_type               = BLE_ADVDATA_FULL_NAME;
    init.advdata.include_appearance      = true;
    init.advdata.flags                   = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE;
    init.advdata.uuids_complete.uuid_cnt = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
    init.advdata.uuids_complete.p_uuids  = m_adv_uuids;

    init.config.ble_adv_fast_enabled  = true;
    init.config.ble_adv_fast_interval = APP_ADV_INTERVAL;
    init.config.ble_adv_fast_timeout  = APP_ADV_DURATION;

    init.evt_handler = on_adv_evt;

    err_code = ble_advertising_init(&m_advertising, &init);
    APP_ERROR_CHECK(err_code);

    ble_advertising_conn_cfg_tag_set(&m_advertising, APP_BLE_CONN_CFG_TAG);
}

/**@brief Clear bond information from persistent storage.
 */
static void delete_bonds(void)
{
    ret_code_t err_code;

   // NRF_LOG_INFO("Erase bonds!");

  //  err_code = pm_peers_delete();
    APP_ERROR_CHECK(err_code);
}
/**@brief Function for starting advertising.
 */
static void advertising_start(void)
{
//    if (erase_bonds == true)
//    {
//      //  delete_bonds();
//        // Advertising is started by PM_EVT_PEERS_DELETE_SUCCEEDED event.
//    }
//    else
//    {
        ret_code_t err_code;

        err_code = ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);
        //APP_ERROR_CHECK(err_code);
//    }
}
/**@brief Function for the GAP initialization.
 *
 * @details This function sets up all the necessary GAP (Generic Access Profile) parameters of the
 *          device including the device name, appearance, and the preferred connection parameters.
 */
static void gap_params_init(void)
{
    ret_code_t              err_code;
    ble_gap_conn_params_t   gap_conn_params;
    ble_gap_conn_sec_mode_t sec_mode;

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

    err_code = sd_ble_gap_device_name_set(&sec_mode,
                                          (const uint8_t *)DEVICE_NAME,
                                          strlen(DEVICE_NAME));
    APP_ERROR_CHECK(err_code);

    memset(&gap_conn_params, 0, sizeof(gap_conn_params));
    //连接参数配置
    gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
    gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
    gap_conn_params.slave_latency     = SLAVE_LATENCY;
    gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;
    
    err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for initializing the GATT module.
 */
static void gatt_init(void)
{
    ret_code_t err_code = nrf_ble_gatt_init(&m_gatt, NULL);
    APP_ERROR_CHECK(err_code);
}

static void led_write_handler(uint16_t conn_handle, ble_lbs_t * p_lbs, uint8_t led_state)
{
    if (led_state)
    {
        //bsp_board_led_on(LEDBUTTON_LED);
        NRF_LOG_INFO("Received LED ON!");
    }
    else
    {
        //bsp_board_led_off(LEDBUTTON_LED);
        NRF_LOG_INFO("Received LED OFF!");
    }
}
/**@brief Function for handling Queued Write Module errors.
 *
 * @details A pointer to this function will be passed to each service which may need to inform the
 *          application about an error.
 *
 * @param[in]   nrf_error   Error code containing information about what went wrong.
 */
static void nrf_qwr_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}
/**@brief Function for initializing services that will be used by the application.
 */
static void uart_software_intterrupt(void)
{
    rt_hw_serial_isr((struct rt_serial_device *)serial, RT_SERIAL_EVENT_RX_IND);
};
static void nus_data_handler(ble_nus_evt_t * p_evt)
{
    if (p_evt->type == BLE_NUS_EVT_RX_DATA)
    {
//        uint32_t err_code;

        rt_kprintf("Received data from BLE NUS. Writing data on UART.\r\n");
        for(int i = 0; i < p_evt->params.rx_data.length; i++)
        {
            rt_kprintf("%c", p_evt->params.rx_data.p_data[i]);
            rt_ringbuffer_putchar(&ringbuffer_handler, p_evt->params.rx_data.p_data[i]);
            uart_software_intterrupt();
        }
        rt_kprintf("\r\n");
        rt_ringbuffer_putchar(&ringbuffer_handler, '\n');
        uart_software_intterrupt();
        switch (p_evt->params.rx_data.p_data[0])
        {
        case 'A':
            hrs_tf_on();
            LOG_I("start transport sample...");
            break;
        case 'B':
            hrs_tf_off();
            LOG_I("stopls transport sample...");
            break;
        case 'C':
            //开始采样存储数据接口
			strcpy(time_stamp, (char *)(p_evt->params.rx_data.p_data)+1);
			time_stamp[13] = '\0';
			printf("start sampling, time: %s \r\n",time_stamp);
			sprintf(file_name, "%s.hex", time_stamp); 	//将时间戳作为文件名
            fd=  open(file_name, O_WRONLY | O_CREAT);
            if(fd>0)
            {
            rt_kprintf("file creat and open successfully\r\n");
            }
            saveadc= rt_timer_create("saveadc", save_value, RT_NULL, rt_tick_from_millisecond(20), RT_TIMER_FLAG_PERIODIC | RT_TIMER_FLAG_SOFT_TIMER);
            if (saveadc != RT_NULL)
                rt_timer_start(saveadc);
            LOG_I("start sample...");
            // close(fd);     
            // if(fd>0)
            // {
            // rt_kprintf("file closed and saved successfully\r\n");
            // }
            break;
        case 'D':
            //结束采样
            rt_timer_delete(saveadc);
            if(fd>0)
                close(fd);

            LOG_I("stop sample...");
            break;
        case 'E':
            //查询当前文件
            LOG_I("start transport sample...");
            break;
        
        case 'F':
            //要求传输指定文件
            LOG_I("start transport sample...");
            break;
          
        case 'R':
            //重启设备
            rt_hw_cpu_reset();
            break;      
        default:
            break;
        }
        
        // ble_nus_data_send(&m_nus, (uint8_t *)p_evt->params.rx_data.p_data, &p_evt->params.rx_data.length, m_conn_handle);
    }


