jch12138/nrf52840_rtt/applications/ble_app_hrs.c
}
MSH_CMD_EXPORT(ble_app_init, ble app start);
INIT_APP_EXPORT(ble_app_init);



//以下为串口接收到数据后操作的各个函数

//int 转为char
void Int_To_Str(int Int_i,char *String_s)
{
	int a;
	int b= 0;	 								//用于计数
	char *ptrfing,pBuffer[5];	//定义一个字符串数组和字符串指针，
	ptrfing = String_s; 			//内部指针指向外部指针，进行参数传递，是属于源参数传递（通过地址），
	if(Int_i< 10)		  				// 当整数小于10，转换为0x格式
	{
		*ptrfing ++ = '0'; 			//单个数字前面补0
		*ptrfing ++ =Int_i+0x30;
	}
	else
	{
		while(Int_i> 0)
		{
			a= Int_i% 10;
			Int_i=Int_i/ 10;
			pBuffer[b++] =a+0x30;	// 通过计算把数字编成ASCII码形式
		}
		b-- ;
		for(;b>= 0;b--) 		// 将得到的字符串倒序
		{
			*(ptrfing++) = pBuffer[b];
		}
	}
	*ptrfing = '\0';
}
/**@brief Function for .
 *开启实时传输
 */


int hrs_tf_on(void)
{
    update = rt_timer_create("update", timeout, RT_NULL, rt_tick_from_millisecond(20), RT_TIMER_FLAG_PERIODIC | RT_TIMER_FLAG_SOFT_TIMER);
    //启动定时器，20ms广播一次数据
    if (update != RT_NULL)
        rt_timer_start(update);
    return RT_EOK;

}

MSH_CMD_EXPORT(hrs_tf_on, transport realtime);
int hrs_tf_off(void)
{
    rt_timer_delete(update);
    return RT_EOK;
}
MSH_CMD_EXPORT(hrs_tf_off, stop transport);

int savetest(void)
{

    fd=  open("\hello.hex", O_WRONLY | O_CREAT);
    if(fd>0)
    {
        rt_kprintf("file creat and open successfully\r\n");
    }
    int32_t timestart=rt_tick_get();
    int count = 10000;
    while(count)
    {
        count --;
        result1 = rt_adc_read(adc_dev, 5);
        result2 = rt_adc_read(adc_dev, 6);
        result3 = rt_adc_read(adc_dev, 7);
        //rt_kprintf("%d %d %d \r\n",result1,result2,result3);
        result[0] = (result1>>8)&0xff;
        result[1] =  result1&0xff;
        result[2] = (result2>>8)&0xff;
        result[3] =  result2&0xff;
        result[4] = (result3>>8)&0xff;
        result[5] =  result3&0xff;
        //rt_kprintf("%d %d %d %d %d %d \r\n",result[0],result[1],result[2],result[3],result[4],result[5]);
        write(fd,result,6);
        rt_thread_mdelay(20);
        

    }
    int32_t timestop=rt_tick_get();
    close(fd);
    rt_kprintf("usetime = %d\r\n",timestop-timestart);

}
MSH_CMD_EXPORT(savetest, test adc save to file);
int readtest()
{   int size;
    char buffer[40];
    fd=  open("\hello.hex", O_RDONLY);
    size = read(fd, buffer, sizeof(buffer));
    for(int i=0;i<=30;i++)
    {
        rt_kprintf("%d ",buffer[i]);
    }
    rt_kprintf(" \r\nsize=%d",size);
}
MSH_CMD_EXPORT(readtest, test adc read to file);
int stop_save(void)
{

}
MSH_CMD_EXPORT(stop_save, stop_save save adcvalue);

// int ble_app_hrs(void)
// {
//     rt_ringbuffer_init(&ringbuffer_handler, ringbuffer, sizeof(ringbuffer));
//     rt_ringbuffer_init(&ringbuffer_putc_handler, ringbuffer_putc, sizeof(ringbuffer_putc));
//     serial = rt_device_find(UART_NAME);
//     if (!serial)
//     {
//         rt_kprintf("find %s failed!\n", UART_NAME);
//         return -RT_ERROR;
//     }
//     static rt_thread_t tid1 = RT_NULL;
//     tid1 = rt_thread_create("softdevice",
//                         ble_app_softdevice, RT_NULL,
//                         4096,
//                         22, 5);
//     if (tid1 != RT_NULL)
//         rt_thread_startup(tid1);
//     rt_timer_t update = rt_timer_create("update", timeout, RT_NULL, rt_tick_from_millisecond(20), RT_TIMER_FLAG_PERIODIC | RT_TIMER_FLAG_SOFT_TIMER);
//     //启动定时器，20ms广播一次数据
//     if (update != RT_NULL)
//         rt_timer_start(update);
//     return RT_EOK;
//     // tid1 = rt_thread_create("serial_task",
//     //                     uart_task, RT_NULL,
//     //                     1024,
//     //                     22, 5);
//     // if (tid1 != RT_NULL)
//     // {
//     //     rt_thread_startup(tid1);
//     // }
//     //
// }
// MSH_CMD_EXPORT(ble_app_hrs, ble app heart rate service);
// INIT_APP_EXPORT(ble_app_hrs);